const mbtiData = {
    ENFJ: {
        type: "ENFJ",
        description: "외향-직관-감정-판단. 타인과의 관계에서 조화와 협력을 중요하시 하고 동기 부여 해주는 버프왕 코끼리 스타일! ENFJ는 기본적으로 따뜻하고, 통찰력 있으며, 타인의 감정에 깊게 공감할 줄 압니다. 이들은 타인을 도와주며 긍정적인 변화를 이끌어내는데 재능이 있어, 타인을 긍정적으로 변화시키는 동기부여를 잘합니다. 이들은 직관을 통해 상황을 통찰하고, 미래 가능성을 볼 줄 아는 눈을 가지고 있습니다. 자신이 본 미래 가능성 때문인지 주변 사람이 그만큼 따라오지 못한다면 큰 실망을 하는 경우가 잦습니다. 너무 큰 기대는 하지마세요… 제발… 또한 이들은 타인을 너무 신경쓰다보니 자신을 때때로 잃어버릴 수 있으니 조심하세요! 내가 우선입니다.",
        image: "../public/mbti-img/ENFJ.png",
        color: "#6f8ca7",
        keywords: { keyword1: "통찰력", keyword2: "동기부여왕", keyword3: "높은기대치" },
        mbtmi: {
            images: "/mbti-img/meetbti-enfj.png",
        },
    },
    ENFP: {
        type: "ENFP",
        description: "외향-직관-감정-인식. 혹시 ENFP세요? 우와아앙 ENFP 시구나~! 우린 귀여운 돌고래. ENFP는 열정적이며 창의적인 사람들로, 새로운 아이디어나 기회에 대해서 열린 마음으로 가능성을 보는데 큰 흥미를 느낍니다. 사람들과의 관계를 중요하게 생각하며, 교류를 통해 자신의 세계를 점점 확장하는 것을 즐깁니다. 이들은 자신의 열정을 다른 사람에게도 전달 할 줄 아는 열정 프로메테우스! 넓은 인맥을 유지하고 확장하는데 재능이 있는 사회성만렙 스타일. 하지만 감정이 우선시 될 때를 조심하세요 ㅠ 과한 감정이 다른 사람과의 갈등을 유발할 수 있습니다. 인싸중의 인싸, 사회성 만렙인 당신은 혹시 ENFP세요? 꺄아악!^^",
        image: "../public/mbti-img/ENFP.png",
        color: "#fdc4f9",
        keywords: { keyword1: "창의력", keyword2: "사회성만렙", keyword3: "감정과잉" },
        mbtmi: {
            images: "/mbti-img/meetbti-enfp.png",
        },
    },
    ENTJ: {
        type: "ENTJ",
        description: "외향-직관-사고-판단. 계획을 바탕으로, 효율성을 추구해 조직을 이끌어나는 백수의 왕 사자 스타일! 누가 씹프피래! 자신만의 이상향을 추구하는 거룩한 사슴 스타일!. ENTJ는 리더십이 뛰어나고, 계획적이며, 효율을 추구합니다. 이들은 다른 사람들이 못 보는 큰 그림을 볼 수 있으며, 문제나 상황을 구조적으로 접근하여 해결하는 능력이 있습니다. 미래 지향적이며, 전략적으로 사고하고 계획을 세우는 것을 좋아합니다. 이들은 빠르고 명확하게 결정을 내리며, 목표달성을 추구하기 때문에 결단력이 뛰어납니다. 조직에서도 결단력을 바탕으로 행동하기 때문에 리더의 위치에서 리더십을 발휘하는 경우가 많습니다. 하지만 자신의 의견이나 방식이 맞다고 고집을 부리다 다른 사람과의 마찰을 빚기도 합니다… 결정을 내릴 때에도 너무 이성적으로만 접근하여 타인에게 상처를 줄 수 있으니 이 점은 조심하세요!",
        image: "../public/mbti-img/ENTJ.png",
        color: "#f8e534",
        keywords: { keyword1: "리더십", keyword2: "결단력", keyword3: "간섭" },
        mbtmi: {
            images: "/mbti-img/meetbti-entj.png",
        },
    },
    ENTP: {
        type: "ENTP",
        description: "외향-직관-사고-인식. 지적호기심 MAX! 변화와 도전을 두려워하지 않는 원숭이 스타일.  ENTP는 창의적이고 지적 호기심이 많은 유형입니다. 새로운 정보를 얻는 것을 좋아해 독서를 즐기는 타입기도 합니다. 이들은 창의적 사고로 세상을 바라보기 때문에 새로운 아이디어나 접근법에 대해서 생각하는 것을 좋아합니다. 따라서 변화와 도전을 두려워하지 않는 타입이기도 합니다. 이들은 논리적 대화를 즐기는 것을 좋아해 토론을 좋아합니다. 상대방의 말을 빠르게 파악하고, 논리적으로 대응할 줄도 아는 논객이기도 합니다. 하지만 논쟁에 과도하게 빠져 필요 이상으로 비판적으로 토론을 이어나가, 상대방의 감정을 상하게 하기도 하니 이 점은 유의하세요!",
        image: "../public/mbti-img/ENTP.png",
        color: "#cf8053",
        keywords: { keyword1: "창의적사고", keyword2: "논쟁러버", keyword3: "감정부족" },
        mbtmi: {
            images: "/mbti-img/meetbti-entp.png",
        },
    },
    ESFJ: {
        type: "ESFJ",
        description: "외향-감각-감정-판단. 타인과의 관계를 중요하게 생각하는 나는야 댕댕이.  ESFJ는 협조적이고 따뜻한 사람들로, 타인과의 관계와 조화를 중요하게 생각해 민감하게 반응합니다. 이들은 타인에게 거의 모든 것이 맞추어져 있는 하나보단 둘! 둘보다는 여럿이 좋아 스타일! 이들의 강점은 모임에서 빛을 발휘합니다. 타인의 감정과 니즈를 잘 이해하고 도움을 주려고 노력해, 모임을 관리하고 조직하는데 탁월한 능력을 지니고 있습니다. 이들은 책임감도 강해 주어진 임무나 책임에 대해 신중하게 생각해, 타인과의 약속을 더욱 중요하게 여깁니다. 하지만 때로는 너무 과도한 관심으로 다른 사람에게 기준을 맞추어 자신을 소홀히 하는 것은 단점입니다. 변화를 좋아하지 않아 안정을 추구하는 것을 좋아해 갑작스러운 일 생기면 가장 크게 당황하는 스타일이기도 합니다. 적당한 관계와 지지를 통해 조율하세요!",
        image: "../public/mbti-img/ESFJ.png",
        color: "#3b3b3b",
        keywords: { keyword1: "조직력", keyword2: "배려왕", keyword3: "과도한관심" },
        mbtmi: {
            images: "/mbti-img/meetbti-esfj.png",
        },
    },
    ESFP: {
        type: "ESFP",
        description: "외향-감각-감정-인식. 주변 사람을 기쁘게 해줄 줄 아는 경청능력 MAX, 앵무새 스타일.  ESFP는 누구보다 주변환경과 주변 사람들에게 열린 유형입니다. 이들은 활기차고 사교적이며, 주변에서 일어나는 일에 즉각적으로 반응합니다.  이들은 감정적인 경험을 중요시하며, 타인에게서 느끼는 따뜻함과 친근함을 누구보다 중요하게 여깁니다. 이들은 다양한 사람들과 교류를 즐기는 인싸중의 인싸, 한번보면 우린 친구 스타일!  다른 사람을 기쁘게 해주는 것을 좋아하며 경청하는 데 재능이 있어 다른 사람들의 문제나 감정에 따뜻하게 공감합니다. 하지만 때로는 감정과잉… 이로인해 갈등이 생길 수 있으니 조심하세요!",
        image: "../public/mbti-img/ESFP.png",
        color: "#fa6060;",
        keywords: { keyword1: "따뜻함", keyword2: "인내심부족", keyword3: "과도한표현" },
        mbtmi: {
            images: "/mbti-img/meetbti-esfp.png",
        },
    },
    ESTJ: {
        type: "ESTJ",
        description: "외향-감각-사고-판단. 전통과 규칙을 중요하게 여기는 성실한 독수리 스타일. ESTJ는 조직생활에 딱 맞춰진 유형입니다. 이들은 정보를 체계적으로 정리하고 구체적인 계획을 세우고 달성하는데 능숙해, 조직을 구성하는 일원으로 충분한 역할을 수행합니다. 따라서 이들은 일관성 있고 실용적인 접근을 선호해 주어진 책임을 성실하게 이행합니다. 이들은 빠른 결정을 내리는 데 재능이 있으며, 명확한 판단으로 행동합니다. 책임감이 강해 한번 시작한 일은 끝장을 보는 책임감 만렙 유형. 하지만 고정된 방식이나 절차에 너무 의존하기 때문에 새로운 상황이나 변화에 대응이 미흡합니다. 감정보다는 논리와 사실을 중요하게 생각하기 때문에 타인의 감정에 민감하게 대응하지 못하는 것이 단점입니다. ",
        image: "../public/mbti-img/ESTJ.png",
        color: "#787cff",
        keywords: { keyword1: "결단력", keyword2: "책임감", keyword3: "유연성부족" },
        mbtmi: {
            images: "/mbti-img/meetbti-estj.png",
        },
    },
    ESTP: {
        type: "ESTP",
        description: "외향-감각-사고-인식. 잡은 기회는 놓치지 않고 현재에 충실하는 치타! ESTP는 현재 순간을 즐기는 사람으로 의견보다는 실제 경험을 중시하는 스타일입니다. 적응력이 뛰어나 어떤 상황에서든 사실을 기반으로 문제를 파악하고 판단해 해결하려고 합니다. 이들은 변화에도 적응력이 뛰어나 상황이 바뀌면 누구보다 빠르게 적응하고 행동합니다. 이들에게 거짓정보를 흘리지마세요. 사실을 가장 중요시하니까요! 순간집중력이 좋지만 인내심이 부족하기 때문에 장기적인 계획엔 조금 미흡합니다. 한마디로 단거리 스프린터! 그러나 주변사람을 잘 챙기고, 사람들과 있을 땐 분위기 메이커 역할을 도맡아 합니다.",
        image: "../public/mbti-img/ESTP.png",
        color: "#454b86",
        keywords: { keyword1: "적응력", keyword2: "인내심부족", keyword3: "직설적" },
        mbtmi: {
            images: "/mbti-img/meetbti-estp.png",
        },
    },
    INFJ: {
        type: "INFJ",
        description: "내향 - 직관 - 감정 - 판단. 자신만의 복잡한 세계를 가진 늑대 스타일! 세계에서 가장 적은 수의 MBTI. 그만큼 유니크하다는 뜻이지. 자신이 중요하게 생각하는 것에 큰 열정을 지닌 열정, 열정, 열정! 깊은 통찰력과 직관을 통해  다른 사람의 감정과 기분에 민감하여 타인을 이해하고 돕는데 아주 탁월합니다. 과도한 완벽주의로 인해 스스로 너무 많은 압박을 가하게 될 수 있다는 것은 금물",
        image: "../public/mbti-img/INFJ.png",
        color: "#A2D0E0",
        keywords: { keyword1: "완벽주의", keyword2: "상처에약함", keyword3: "내면세계복잡" },
        mbtmi: {
            images: "/mbti-img/meetbti-infj.png",
        },
    },
    INFP: {
        type: "INFP",
        description: "내향-직관-감정-인식. 누가 씹프피래! 자신만의 이상향을 추구하는 거룩한 사슴 스타일! INFP는 이상주의적이며, 깊은 가치관과 진실성을 가지고 있어요. 이들은 자신이 내면 세계와 감정을 중시하며, 자신만의 독특한 방식으로 세상을 바라봅니다. 무엇이든 자신만의 신념을 기준으로 결정하며, 자아정체성에 큰 중점을 두고 있어요. 이들은 타인에게 이해와 공감을 갖고 접근하며 사람을 돌보는 것을 중요하게 생각해 겉으로는 낯을 가리는 것 같지만 친해지면 자신의 생각과 감정을 전달하는데 많은 노력을 기울입니다. 진대타임을 가장 좋아하는 유형이기도 해요! 혹시 편의점 의자 좋아하세요…? 하지만 이들은 비판에 취약해 타인의 비판이나 부정적인 의견을 너무 민감하게 받아들이고, 자신의 세계에 너무 몰두한 나머지 현실감각이 떨어져 보일 수도 있습니다.",
        image: "../public/mbti-img/INFP.png",
        color: "#56d36b",
        keywords: { keyword1: "이상주의", keyword2: "자아정체성", keyword3: "내성부족" },
        mbtmi: {
            images: "/mbti-img/meetbti-infp.png",
        },
    },
    INTJ: {
        type: "INTJ",
        description: "내향 - 직관 - 사고 - 판단. 독립적이며, 타인의 의견에 휘둘리지 않는 고고한 고양이 냥! 이들은 독립적이며, 깊은 통찰력을 바탕으로 한 전략적 비젼을 지니고 있다. 자신의 아이디어와 미래에 대해 확신이 있으며, 장기적인 플랜을 잘 세운다. 복잡한 문제 해결을 좋아하며, 자신만의 유니크하고 독특한 방법으로 해결하기도 한다. 미래지향적이며, 목표가 정해지면 체계적으로 직진하는 스타일! 이들은 자신과 타인에게 기준이 너무 높아서 비판적이기도, 엄격하기도 한답니다… 진지한 대화를 선호하며, 타인에게 자신의 생각과 감정을 잘 드러내지 않지만 신뢰하면 깊은 연결을 나누려고 하는 고고한 고양이다 냥!",
        image: "../public/mbti-img/INTJ.png",
        color: "#AEA9A9",
        keywords: { keyword1: "창의적", keyword2: "높은기준선", keyword3: "장기계획형" },
        mbtmi: {
            images: "/mbti-img/meetbti-intj.png",
        },
    },
    INTP: {
        type: "INTP",
        description: "내향-직관-사고-인식. 자유로운 자신만의 기준으로 세상을 바라보는 고독한 여우 스타일.  INTP는 태생부터 분석가 기질을 타고났습니다. 주변환경에서 관찰한 패턴과 흐름을 발견하는데 능숙해 자유롭고 독립적인 사고를 키우며, 자신만의 방식으로 복잡한 문제를 해결하곤 합니다. 이들은 논리와 분석을 중요하게 생각해 일관된 근거와 이유를 세상에서 가장 중요하게 여깁니다. 자신만의 생각과 판단을 믿기 때문에 타인의 말에 잘 휘둘리지 않고 자신만의 길을 잘 찾습니다. 하지만 논리가 우선이라 타인과의 대화에서 감정적인 상황이나 자신을 표현하는데 어려움을 겪기도 하며, 아이디어는 많지만 시작한 일을 잘 끝내지 못하는 용두사미, 작심삼일 서타일… (혹시 헬스장  며칠이나 다니셨어요?) 내성적이고 거리감이 있어 보이지만 친해지면 자신의 유우머를 곧잘 나눕니다. 그러니 친해지세요! 그래야 INTP의 진면목을 보게 될 겁니다.",
        image: "../public/mbti-img/INTP.png",
        color: "#ffc53f",
        keywords: { keyword1: "분석가", keyword2: "고독한 여우", keyword3: "독립적" },
        mbtmi: {
            images: "/mbti-img/meetbti-intp.png",
        },
    },
    ISFJ: {
        type: "ISFJ",
        description: "내향 - 감각 - 감정 - 판단. 진실되고 헌신적인 배려양~. 내성적이지만 사회성이 높은 당신은 진정한 자애로운 이타주의자! 이 유형의 사람들은 관찰력이 좋고, 타인에 대한 세심한 기억력이 좋아, 상대별 맞춤 배려를 잘 해요. 안정감과 조화를 추구하는 당신은 현실적인 상황과 경험을 기반으로 판단을 내려요. 휘둘리지 않고, 자기만의 판단력이 있는 소신있는 유형이기도 해요! 여럿보다는 1:1 관계를 좋아하고, 자신만의 선이 있어서 누군가 그 선을 넘는걸 엄청 싫어해요. MBTI 유형 중 가장 정의 내리기 어려운 유형이기도 해요 ㅠ",
        image: "../public/mbti-img/ISFJ.png",
        color: "#78d4ff",
        keywords: { keyword1: "관찰력만렙", keyword2: "배려왕", keyword3: "예의가 우선" },
        mbtmi: {
            images: "/mbti-img/meetbti-isfj.png",
        },
    },
    ISFP: {
        type: "ISFP",
        description: "내향-감각-감정-인식. 삶의 순간들을 소중히 여기고 조화를 이루는 토끼 스타일. ISFP는 삶의 순간들을 소중히 여기며, 현실적이면서도 주변과 조화를 이루려고 노력하는 진실의 아이콘 뛰어난 관찰력으로 주변 환경과 사람들을 잘 캐치하여 유연하고 개방적으로, 상황에 따라 적절하게 대응할 줄도 알며, 타인과 깊은 감정을 나누기도 합니다. 예술적 감각도 뛰어나 요리, 공예, 미술, 음악 등 창작 활동에도 아주 능합니다. 하지만 이들은 결정을 잘 못하는 타입이기도 합니다. 어떤 선택이나 결정을 내릴 때 갈팡질팡하는 대표적 선택못해 유형. 또한 감정 충돌에 대해 내성이 없어 타인과 충돌이 일어났을 때, 대처가 미흡합니다… 가까운 사람에게 한없이 따뜻하고 친절한, 타인의 감정과 생각을 존중하는 그대는 깡총 귀여운 토끼! ",
        image: "../public/mbti-img/ISFP.png",
        color: "#FFADAD",
        keywords: { keyword1: "진실한행동", keyword2: "자애로움", keyword3: "충돌에약함" },
        mbtmi: {
            images: "/mbti-img/meetbti-isfp.png",
        },
    },
    ISTJ: {
        type: "ISTJ",
        description: "내향 - 감각 - 사고 - 판단. 책임감 높고 규칙과 프로세스를 중시하는 나는야 개미. ISTJ는 세계에서 가장 흔한 유형이이자, 책임감이 강해 사람들이 신뢰하는 유형이에요. 이들은 어떤 일이든 완벽하게  해내기 위해 노력해요. ISTJ 유형의 사람들은 특히 약속을 중요하게 여기기 때문에 사람들에게서 신뢰도가 높아요. 하지만 이들은 혼자 또는 작은 무리의 친구들과 지내는 시간을 선호하기 때문에 다른 사람의 감정을 파악하는데는 어려움을 겪을지도 모르겠네요. 다른 말로 타인에게 관심이 없는 인간 싫어 유형 ㅠㅠ(이모티콘)또한 이 유형은 자신의 생각이 맞다고 생각 하는 경향이 높기 때문에, 고집이 세다는 말을 자주 듣기도 해요.",
        image: "../public/mbti-img/ISTJ.png",
        color: "#c484f8",
        keywords: { keyword1: "인내심MAX", keyword2: "책임감만렙", keyword3: "혼자가좋아" },
        mbtmi: {
            images: "/mbti-img/meetbti-istj.png",
        },
    },
    ISTP: {
        type: "ISTP",
        description: "내향-감각-사고-인식. 현실적이며 빠르고 유연하게 대응할 줄 아는 높은 집중력의 호랑이 스타일. 이들은 현실적이고, 분석적으로 세상에 접근합니다. 상황에 따라 유연하게 대처할줄도 알아고 사물이나 상황을 분해해서 핵심에 접근하기 때문에, 실제 문제 해결에 아주 능숙합니다. 계획에 얽매이지 않고 순간 집중력이 좋아 즉각 대응이 좋지만, 장기적인 계획 완수에는 어려움을 느끼기도 합니다 ㅠ. 이들은 자신의 감정을 표현하는데 어려움을 느낄 수 있어서, 사회적 상황에서 대체로 조용하고 무표정이라 오해를 받기도 합니다. 하지만 관심있는 주제에 대해서는 활발하게 의견을 나눌 만큼 열정있는 스타일! 물론 논리와 사실에 기반해서. 감정적인 대화보다는 구체적이고 실제적인 정보를 주고받는 것을 선호하는.. 너 T야? ",
        image: "../public/mbti-img/ISTP.png",
        color: "#986b5e",
        keywords: { keyword1: "분석적", keyword2: "순간집중력", keyword3: "무표정" },
        mbtmi: {
            images: "/mbti-img/meetbti-istp.png",
        },
    },
};

export default mbtiData;